app/Controllers/Auth.php

    public function do_login()
    {
        $model = new PetugasModel();
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $user = $model->where('username', $username)->first();
---
SELECT *
FROM `petugas`
WHERE `username` = 'admin1'
 LIMIT 1