app/Controllers/Datapetugas.php

    public function index()
    {
        $data['petugas'] = $this->petugasModel->findAll();
---
SELECT *
FROM `petugas`