app/Controllers/Datakelas.php

SELECT *
FROM `kelas`
---
    public function index()
    {
        $model = new KelasModel();
        $data['kelas'] = $model->findAll();