app/Controllers/Datasiswa.php

    public function index()
    {
        $data['siswa'] = $this->siswaModel->findAll();
---
SELECT *
FROM `siswa`