app/Controllers/DatasiswaView.php

SELECT `siswa`.*, `kelas`.`nama_kelas`
FROM `siswa`
LEFT JOIN `kelas` ON `siswa`.`id_kelas` = `kelas`.`id_kelas`
---
    public function index()
    {
        // Use the builder for SiswaModel
        $builder = $this->siswaModel->builder();
        $builder->select('siswa.*, kelas.nama_kelas');
        $builder->join('kelas', 'siswa.id_kelas = kelas.id_kelas', 'left');
        $data['siswa'] = $builder->get()->getResultArray();