app/Controllers/HistoryPembayaran.php

SELECT `pembayaran`.*, `petugas`.`nama_petugas`
FROM `pembayaran`
LEFT JOIN `petugas` ON `pembayaran`.`id_petugas` = `petugas`.`id_petugas`
---
    public function index()
    {
        $builder = $this->pembayaranModel->builder();
        $builder->select('pembayaran.*, petugas.nama_petugas');
        $builder->join('petugas', 'pembayaran.id_petugas = petugas.id_petugas', 'left');
        $data['history'] = $builder->get()->getResultArray();