app/Controllers/Pembayaran.php

SELECT *
FROM `pembayaran`
SELECT *
FROM `petugas`
---
    public function index()
    {
        $data = [
            'pembayaran' => $this->pembayaranModel->findAll(),
            'petugas' => $this->petugasModel->findAll(),
            'spp' => $this->sppModel->findAll()
        ];